app/controllers/api/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."name" = $1 LIMIT $2  [["name", "solution"], ["LIMIT", 1]]
---
  def show
    @product = Product.find_by(name: params[:name])