app/controllers/api/products_controller.rb

  def index
    @products = Product.all
      .includes(:product_category)
      .includes(:category)
    @product_categories = ProductCategory.all
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."product_id" IN ($1, $2, $3, $4, $5, $6, $7, $8)  [["product_id", 9], ["product_id", 10], ["product_id", 11], ["product_id", 12], ["product_id", 13], ["product_id", 14], ["product_id", 15], ["product_id", 16]]
SELECT "products".* FROM "products"
SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."product_id" = $1  [["product_id", 30]]

  def show
    # debugger
    name = params[:name].gsub('-', ' ')
    @product = Product
      .includes(:variations)
      .includes(:description)
      .includes(:instruction)
      .includes(:size)
      .includes(:product_size)
      .includes(:category)
      .includes(:product_category)
      .includes(:ingredients)
      .includes(:product_ingredient)
      .includes(:tags)
      .includes(:product_tag)
      .find_by(name: name)
---
SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."product_id" IN ($1, $2, $3, $4, $5, $6, $7, $8)  [["product_id", 1], ["product_id", 2], ["product_id", 3], ["product_id", 4], ["product_id", 5], ["product_id", 6], ["product_id", 7], ["product_id", 8]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
SELECT "tags".* FROM "tags" WHERE "tags"."id" IN ($1, $2, $3)  [["id", 16], ["id", 14], ["id", 11]]