app/controllers/api/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "mpnTQbIF6vPjr78RZ1_KAw"], ["updated_at", "2019-11-05 02:06:53.852031"], ["id", 1]]
---
  def create
    @user = User.new(user_params)
    if @user.save
      login!(@user)
      cart = Cart.create({ user_id: @user.id })
      cart.save