project/glossier/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "mpnTQbIF6vPjr78RZ1_KAw"], ["updated_at", "2019-11-05 02:06:53.852031"], ["id", 1]]
---
  def reset_session_token
    self.session_token = new_session_token
    self.save!