project/glossier/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "6tqCPk1ij0KU1nALV9dFSg"], ["updated_at", "2019-11-07 22:39:06.796702"], ["id", 13]]
---
  def reset_session_token
    self.session_token = new_session_token
    self.save!