app/views/api/products/show.json.jbuilder

instruction = product.instruction
size = product.size
---
SELECT  "sizes".* FROM "sizes" INNER JOIN "product_sizes" ON "sizes"."id" = "product_sizes"."size_id" WHERE "product_sizes"."product_id" = $1 LIMIT $2  [["product_id", 29], ["LIMIT", 1]]