app/models/user.rb

  def reset_session_token
    self.session_token = new_session_token
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "v74jF8ESpBcZHOwsnWG5tg"], ["updated_at", "2019-11-08 23:05:56.671284"], ["id", 3]]